Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Significant updates on the encoding pragma functionality (tr/// and the DATA filehandle, formats).
es_es: Actualizaciones significativas en la funcionalidad del pragma de codificación (formatos tr/// y del identificador de archivo de datos DATA).

source: comp.lang.perl.misc High traffic general Perl discussion
es_es: comp.lang.perl.misc Discusión general sobre Perl, con mucho tráfico

source: FETCH this, key
es_es: FETCH este, clave

source: His UTF-8 rants during the Amsterdam Perl Mongers meetings got me interested and determined to find out how to use character encodings in Perl in ways that don't break easily.
es_es: Sus diatribas contra UTF-8 en las reuniones de los Amsterdam Perl Mongers hicieron que me interesara por el tema y me propusiera aprender a utilizar de una manera segura las codificaciones de caracteres en Perl.

source: Perl will not guarantee what the result of the above statements is.
es_es: Perl no garantizará el resultado de las instrucciones anteriores.

source: According to Damian Conway, you should consider using OO:
es_es: De acuerdo con Damian Conway, debe considerar el uso de POO:

source: Because C<scalar> is a unary operator, if you accidentally use a parenthesized list for the EXPR, this behaves as a scalar comma expression, evaluating all but the last element in void context and returning the final element evaluated in scalar context.
es_es: Dado que C<scalar> es un operador unario, si, accidentalmente, usa para EXPR una lista entre paréntesis, esto se comportará como una expresión escalar con comas, evaluando todos, menos el último elemento, en contexto vacío, y devolviendo el elemento final evaluado en contexto escalar.

source: =head2 (Win32) The /d Switch Of cmd.exe
es_es: =head2 (Win32) La opción /d de cmd.exe

source: Thus, a comma terminates the argument of a unary operator, but merely separates the arguments of a list operator.
es_es: Así, una coma determina al argumento de un operador unario, pero sólo sirve de separación entre argumentos en un operador de listas.

source: support for light-weight processes (threads)
es_es: compatibilidad con procesos ligeros (hebras I<threads>)

source: C<1,,3> is C<(1,),(3)> is C<1,3> (And similarly for C<1,,,3> is C<(1,),(,),3> is C<1,3> and so on.) Not that we'd advise you to use this obfuscation.
es_es: C<1,,3> es C<(1,),(3)> es C<1,3> (y similarmente para C<1,,,3> es C<(1,),(,),3> es C<1,3> y así sucesivamente). No le aconsejamos usar este tipo de ofuscación.

source: Improved error and warnings messages.
es_es: Mejora en los mensajes de errores y advertencias.

source: If the other end can't handle that, be sure to read all the data before closing the pipe.
es_es: Si en el otro extremo no puede manejar esto, asegúrese de leer todos los datos antes de cerrar la tubería.

source: didn't work correctly but instead corrupted the data.
es_es: no funciona correctamente, sino que corrompe los datos.

source: On systems that don't support fchdir(2), passing handles raises an exception.
es_es: En sistemas que no admiten fchdir(2), pasarle un identificador de archivo lanza una excepción.

source: Now that we have the C<*foo{THING}> notation, typeglobs aren't used as much for filehandle manipulations, although they're still needed to pass brand new file and directory handles into or out of functions.
es_es: Ahora que tenemos la notación C<*foo{COSA}>, typeglobs no se utilizan tanto para la manipulación de identificadores de archivo, aunque siguen siendo necesarios para pasar identificadores de archivo y de directorio dentro o fuera de funciones.

source: While Perl 5.10 included the port to Mac OS, ExtUtils::MakeMaker, a core part of Perl's module installation infrastructure officially dropped support for Mac OS in April 2004.
es_es: Aunque Perl 5.10 incluía la versión para Mac OS, ExtUtils::MakeMaker, una parte central de la instalación de infraestructura de módulos Perl oficialmente abandonó el soporte para Mac OS en abril de 2004.

source: =head2 New "5.005 threads are deprecated"
es_es: =head2 Nuevo "5.005 threads are deprecated"

source: (.*\D)(\d+)$ <I have 2 numbers: > <53147>
es_es: (.*\D)(\d+)$ <Tengo 2 números: > <53147>

source: perlhacktut Walk through the creation of a simple C code patch
es_es: perlhacktut Paso a paso por la creación de un sencillo parche en código C

# $s = "hi there ";
source: $s = "hi there\n";
es_es: $s = "hola por aquí\n";

source: is the same as
es_es: es lo mismo que

source: Binary "~~" does a smart match between its arguments.
es_es: Binario "~~" hace una coincidencia inteligente entre sus argumentos.

source: by Randal L. Schwartz and brian d foy, with Tom Phoenix
es_es: Randal L. Schwartz y brian d foy, con Tom Phoenix

source: The existing VMS-specific ability to access individual elements of a search list logical name via the $ENV{'foo;N'} syntax (where N is the search list index) is unimpaired.
es_es: La actual habilidad específica de VMS de acceder a elementos individuales de un nombre lógico de lista de búsqueda a través de la sintaxis $ENV{'foo;N'} (donde N es el índice de la lista de búsqueda) no se ve afectada.

source: my @colors = values %fruit_colors;
es_es: my @colores = values %colores_fruta;

source: If there is more than one argument in LIST, or if LIST is an array with more than one value, starts the program given by the first element of the list with arguments given by the rest of the list.
es_es: Si hay más de un argumento en LISTA, o si la lista es un array con más de un valor, se inicia el programa indicado en el primer elemento de la lista, con los argumentos indicados por el resto de la lista.

source: remove Time::Piece
es_es: eliminar Time::Piece

source: Note that on some systems, a return value of C<-1> could mean that child processes are being automatically reaped.
es_es: Tenga en cuenta que en algunos sistemas, un valor devuelto de C<-1> podría significar que los procesos hijos se están automáticamente desechando.

source: # Note that the exact meaning of these is system dependent.
es_es: # Tenga en cuenta que el significado exacto de éstos depende del sistema.

source: This is mainly an issue on 64-bit platforms.
es_es: Esto es sobre todo un problema en plataformas de 64-bits.

source: They check different things so you need both.
es_es: Comprueban cosas distintas, por lo que ambas deben ser incluidas.

source: =head2 Tests
es_es: =head2 Pruebas

source: C<%hash ~~ sub {}> and C<@array ~~ sub {}> now test that the subroutine returns a true value for each key of the hash (or element of the array), instead of passing the whole hash or array as a reference to the subroutine.
es_es: C<%hash ~~ sub {}> y C<@array ~~ sub {}> ahora prueban a que la subrutina devuelva un valor verdadero por cada clave del hash (o cada elemento del array), en lugar de pasar todo el hash o el array, como referencias, a la subrutina.

source: It is only an illusion that the operating system, device drivers, C libraries, and Perl all conspire to preserve.
es_es: Es sólo una ilusión que el sistema operativo, controladores de dispositivo, bibliotecas de C, y Perl, conspiran para preservar.

source: Both "fetch" filters remove the terminating NULL, and both "store" filters add a terminating NULL.
es_es: Los dos filtros "fetch" quitan el carácter NULL de terminación y los dos filtros "store" agregan un carácter NULL de terminación.

source: The socket tests may fail if the network is not configured.
es_es: Si la red no está configurada, las pruebas de sockets pueden generar errores.

source: shows that number of returned elements can differ from the number of input elements.
es_es: demuestra que el número de elementos devueltos pueden diferir de la cantidad de elementos de la entrada.

source: $hash{12345} = "something";
es_es: $hash{12345} = "algo";

source: Perl officially stands for Practical Extraction and Report Language, except when it doesn't.
es_es: Oficialmente, Perl significa Practical Extraction and Report Language (I<Lenguaje práctico para la extracción de datos y creación de informes>), excepto cuando no hace eso.

source: HTML output will now correctly link to C<=item>s on the same page, and should be valid XHTML.
es_es: Ahora la salida HTML enlazará correctamente con C<=item> en la misma página, y deberá ser un XHTML válido.

source: On some systems, you can avoid this by setting C<$SIG{CHLD}> to C<"IGNORE">.
es_es: En algunos sistemas, puede evitar esto poniendo C<$SIG{CHLD}> a C<"IGNORE">.

source: open(LOG, ">>/usr/spool/news/twitlog"); # (log is reserved)
es_es: open(LOG, ">>/usr/spool/news/twitlog"); # (log es palabra reservada)

source: Hint: sometimes appending C<", stopped"> to your message will cause it to make better sense when the string C<"at foo line 123"> is appended.
es_es: Consejo: algunas veces añadir C<", parado"> a tu mensaje hará aparecerle con un sentido mejor cuando se le añada la cadena C<"at foo line 123">.

source: STORE this, value
es_es: STORE este, valor

source: Otherwise, if the PATTERN contains a $ that looks like a variable rather than an end-of-string test, the variable will be interpolated into the pattern at run-time.
es_es: De lo contrario, si el PATRÓN contiene un $ que parece más una variable que una marca de fin de cadena, la variable será interpolada en el patrón, en tiempo de ejecución.

source: Small changes in the PLAINTEXT or SALT will result in large changes in the digest.
es_es: Pequeños cambios en TEXTPLANO o SALTO resultarán en grandes cambios en el I<digest>.

source: Over the years, Perl has grown into a general-purpose programming language.
es_es: Con los años, Perl se ha convertido en un lenguaje de programación de propósito general.

source: other array.
es_es: del otro array.

source: =head2 I grabbed the sources and tried to compile but gdbm/dynamic loading/malloc/linking/... failed.
es_es: =head2 He descargado el código fuente y he intentado compilarlo, pero gdbm/dynamic no puede cargar /malloc/linking/...

source: my @fruits = keys %fruit_colors;
es_es: my @frutas = keys %colores_fruta;

source: $field = $query->radio_group( name => 'group_name', values => ['eenie','meenie','minie'], default => 'meenie', linebreak => 'true', labels => \%labels
es_es: $field = $query->radio_group( name => 'nombre_grupo', values => ['eenie','meenie','minie'], default => 'meenie', linebreak => 'true', labels => \%etiquetas

source: == equality
es_es: == igual que

source: sub aeq { # compare two list values
es_es: sub aeq { # comparar dos listas de valores

source: To present something as hex, look into L</printf>, L</sprintf>, and L</unpack>.
es_es: Para presentar algo en formato hexadecimal, mire en L</printf>, L</sprintf> o L</unpack>.

source: You need to cover the following subjects:
es_es: Es necesario que cubra los siguientes temas:

source: @hashes = map +{ lc($_) => 1 }, @array # EXPR, so needs comma at end
es_es: @hashes = map +{ lc($_) => 1 }, @array # EXPR, por lo que necesita una coma al final

source: perlunifaq Perl Unicode FAQ
es_es: perlunifaq Preguntas más frecuentes sobre Unicode

source: Simplified the build process by using the MPEAUTOCONF functionality in Mark Klein's ld.
es_es: Simplificado el proceso de generación mediante la funcionalidad MPEAUTOCONF en el ld de Marcos Klein.

source: regular expression enhancements
es_es: mejoras de las expresiones regulares

source: I<The Perl Review> ( http://www.theperlreview.com ) focuses on Perl almost completely (although it sometimes sneaks in an article about another language).
es_es: I<The Perl Review> ( http://www.theperlreview.com ) se centra en Perl casi en exclusiva (aunque a veces incluye algún artículo sobre otro lenguaje).

source: =head2 Bitwise And X<operator, bitwise, and> X<bitwise and> X<&>
es_es: =head2 And binario X<operator, bitwise, and> X<bitwise and> X<&> X<operador, binario, and> X<binario and>

source: Make sure <gethostbyname()> is called in SCALAR context and that its return value is checked for definedness.
es_es: Cerciorarse de que <gethostbyname()> es llamado en contexto ESCALAR y que se comprueba que su valor de retorno está definido.

source: shutdown(Rdr, 1); # no more writing for reader
es_es: shutdown(Rdr, 1); # no más escrituras para el lector

source: =head2 Platform-specific fixes
es_es: =head2 Arreglos específicos por plataforma

source: exists may also be called on array elements, but its behavior is much less obvious and is strongly tied to the use of L</delete> on arrays.
es_es: exists también pueden ser llamado sobre elementos de array, pero su comportamiento es mucho menos evidente, y está fuertemente ligado a la utilización de L</delete> en arrays.

source: (In the absence of an explicit C<return>, a subroutine, eval, or do FILE automatically returns the value of the last expression evaluated.)
es_es: (En ausencia de un C<return> explícito, una subrutina, eval, o do ARCHIVO, automáticamente devuelve el valor de la última expresión evaluada).

source: If this is a problem, you can call C<POSIX:_exit($status)> to avoid END and destructor processing.
es_es: Si esto es un problema, puede llamar a C<POSIX:_exit($estado)> para saltar el procesado de END y de los destructores.

source: The (mis)use of C</tmp> in core modules and documentation has been tidied up.
es_es: El (mal) uso de C</tmp> en módulos básicos y documentación han sido recortados.

source: @ Null-fill or truncate to absolute position, counted from the
es_es: @ Relleno con nulos o truncar a una posición absoluta, contado desde el

source: You may prefer to use the C<each> function to iterate over such.
es_es: Puede preferir usar la función C<each> para iterar sobre tales listas.

source: =head3 Version Strings X<version string> X<vstring> X<v-string>
es_es: =head3 Cadenas de versión X<version string> X<vstring> X<v-string> X<cadena versión>

source: Once compiled, the behavior doesn't change regardless of what rules are in effect when the regular expression is executed.
es_es: Una vez compilado, el comportamiento no cambia, independientemente de las reglas que entren en vigor cuando la expresión regular se ejecute.

source: # sort numerically ascending
es_es: # ordenación numérica ascendente

source: There are significantly more tests for the C<B> suite of modules.
es_es: Hay significativamente más pruebas para el conjunto de módulos C<B>.

# print $key, ' = ', unpack('L',$val), " ";
source: print $key, ' = ', unpack('L',$val), "\n";
es_es: print $clave, ' = ', unpack('L',$valor), "\n";

source: perlfaq3 Programming Tools
es_es: perlfaq3 Herramientas de programación

source: perlmodlib Perl modules: how to write and use
es_es: perlmodlib Programación y utilización de módulos Perl

source: It's widely used for everything from quick "one-liners" to full-scale application development.
es_es: Es ampliamente utilizado para todo, desde las rápidas "una-línea" hasta el desarrollo de aplicaciones a gran escala.

source: In particular, for an C<eval BLOCK> statement, $subroutine is C<(eval)>, but $evaltext is undefined.
es_es: En particular, para una instrucción C<eval BLOQUE>, $subrutina es C<(eval)>, pero $evaltext es indefinido.

source: If this command lists any paths that don't exist on your system, then you may need to move the appropriate libraries to these locations, or create symbolic links, aliases, or shortcuts appropriately.
es_es: Si este comando muestra rutas de acceso que no existen en el sistema, es posible que tenga que mover las bibliotecas necesarias a estas ubicaciones o crear los vínculos simbólicos, alias o accesos directos correspondientes.

source: That method may be best because otherwise you won't treat IEEE notations like C<NaN> or C<Infinity> properly.
es_es: Este método podría ser mejor porque de otro modo no podría tratar notaciones IEEE como C<Nan> o C<Infinity>.

source: s/(\d+)/ \1 + 1 /eg; # causes warning under -w
es_es: s/(\d+)/ \1 + 1 /eg; # provoca una advertencia bajo -w

source: # same as map assignment above
es_es: # la misma asignación que la anterior con map

source: =head1 Supported Environments
es_es: =head1 Entornos soportados

source: The C<redo> command restarts the loop block without evaluating the conditional again.
es_es: El comando C<redo> reinicia la iteración sin evaluar de nuevo la condición.

source: It provides the key feature of C<base> without the feature creep.
es_es: Proporciona la característica clave de C<base> sin la función de fluencia.

source: Note that currently some test scripts may fail when run in parallel (most notably C<ext/IO/t/io_dir.t>).
es_es: Tenga en cuenta que en la actualidad algunos scripts de prueba pueden fallar cuando se ejecuta en paralelo (sobre todo C<ext/IO/t/io_dir.t>).

source: Please report any errors, updates, or suggestions to F<perlbug@perl.org>.
es_es: Por favor, informe de cualquier error, actualización o sugerencias a F<perlbug@perl.org>.

source: (This just extends the existing rule that applies to the regular or operator, as in C<when (expr1 || expr2)>.)
es_es: (Esto amplia la regla actual que se aplica al operador or normal, como en C<when (expr1 || expr2)>.)

source: By default, empty leading fields are preserved, and empty trailing ones are deleted.
es_es: Por defecto, los campos vacíos precedentes son preservados, y los campos vacíos consecuentes son eliminados.

source: IF YOU RUN INTO TROUBLE =======================
es_es: SI SE ENCUENTRA CON PROBLEMAS =============================

source: $AoA[$i] = [ split " ", $line ];
es_es: $AoA[$i] = [ split " ", $linea ];

source: You can also put directly the path to your perl executable, like in C<#!/usr/bin/perl>).
es_es: También puede especificar directamente la ruta de acceso a su ejecutable perl: C<#!/usr/bin/perl>).

source: The "grab all you can, and do not give anything back" semantic is desirable in many situations where on the first sight a simple C<()*> looks like the correct solution.
es_es: La semántica "agarrar todo lo que puedas, y no dar nada a cambio" es deseable en muchas situaciones en las que, a primera vista, un simple C<()*> parece la solución correcta.

source: The compile-time value of the C<%^H> hint variable can now propagate into eval("")uated code.
es_es: El valor en tiempo de compilación de la variable especial C<%^H> ahora se puede propagar en un código eval("")uado.

source: /^$/); # skip header lines, short for # next LINE if ($.
es_es: /^$/); # salta las líneas de cabecera, resumen de # next LINEA if ($.

source: print @ary; # prints 1324
es_es: print @ary; # imprime 1324

source: You can use the C<break> keyword to break out of the enclosing C<given> block.
es_es: Puede usar la palabra clave C<break> para salir del bloque C<given> actual.

source: /(?<char>.)\k<char>/ # ... a different way and print "'$+{char}' is the first doubled character\n";
es_es: /(?<car>.)\k<car>/ # ... de otra forma and print "'$+{car}' es el primer carácter repetido\n";

source: Accelerated Unicode case mappings (C</i>, C<lc>, C<uc>, etc).
es_es: Mapeos acelerados en el cambio de tamaño de caja en Unicode (C</i>, C<lc>, C<uc>, etc).

source: See L<perlipc/"Safe Pipe Opens"> for more examples of this.
es_es: Ver L<perlipc/"Aperturas seguras de tuberías"> para más ejemplos sobre esto.

source: Since v5.8.0, Perl has built using PerlIO by default.
es_es: Desde v5.8.0, Perl ha sido construido para que use PerlIO por defecto.

source: (See C<open>.) However, an explicit C<close> on an input file resets the line counter (C<$.>), while the implicit close done by C<open> does not.
es_es: (Ver C<open>). Sin embargo, un C<close> explícito en un archivo de entrada reinicia el contador de líneas (C<$.>), mientras que un C<close> implícito hecho por C<open>, no.

source: J A Perl internal unsigned integer value (UV).
es_es: J Un valor Perl interno entero sin signo (UV).

source: Once the left operand is true, the range operator stays true until the right operand is true, I<AFTER> which the range operator becomes false again.
es_es: Una vez que el operando izquierdo sea verdadero, el operador rango se mantiene así hasta que el operando de la derecha sea verdadero, I<DESPUÉS> de lo cual, el operador rango se vuelve falso de nuevo.

source: Please only use this address for security issues in the Perl core, not for modules independently distributed on CPAN.
es_es: Por favor, utilice sólo esta dirección para problemas de seguridad en el núcleo de Perl, no para los módulos distribuidos de forma independiente en CPAN.

source: return (first, <$handle>) if $ALL; # Or here.
es_es: return (first, <$handle>) if $TODO; # O aquí.

source: # a cheap and nasty way to break an email address up into parts
es_es: # manera rápida de descomponer una dirección de correo electrónico

source: The C preprocessor including the #include statements in the preprocessor output (.i) file.
es_es: El preprocesador de C, incluyendo las instrucciones #include en el archivo de salida del preprocesador (.i).

# print "True " if $hash{$key};
source: print "True\n" if $hash{$key};
es_es: print "Verdadero\n" if $hash{$clave};

source: Binary "||" performs a short-circuit logical OR operation.
es_es: Binario "||" realiza una operación lógica OR abreviada.

source: Compare L</values>.
es_es: Compare con L</values>.

source: A fundamental feature of regular expression matching involves the notion called I<backtracking>, which is currently used (when needed) by all regular non-possessive expression quantifiers, namely C<*>, C<*?>, C<+>, C<+?>, C<{n,m}>, and C<{n,m}?>.
es_es: Una característica fundamental de las expresiones regulares incluye la noción llamada I<backtracking> (vuelta atrás), que se utiliza actualmente (cuando es necesario) por todos los cuantificadores de expresiones regulares no posesivos, es decir, C<*>, C<*?>, C<+>, C<+?>, C<{n,m}>, and C<{n,m}?>.

source: You could, for example, group binary digits by threes (as for a Unix-style mode argument such as 0b110_100_100) or by fours (to represent nibbles, as in 0b1010_0110) or in other groups.
es_es: Podría, por ejemplo, agrupar los dígitos binarios en grupos de tres en tres (como si fuera, al estilo Unix, de un argumento de modo, como en 0b110_100_100) o de cuatro en cuatro (para representar nibbles, como en 0b1010_0110) o en otros grupos.

source: It quickly became a good language for many system management tasks.
es_es: Rápidamente se convirtió en un magnífico lenguaje para muchas tareas de gestión de sistemas.

source: These modifiers, new in 5.14, affect which character-set semantics (Unicode, ASCII, etc.) are used, as described below in L</Character set modifiers>.
es_es: Estos modificadores, nuevos en 5,14, afectan a la semántica del conjunto de caracteres (Unicode, ASCII, etc) que se utiliza, como se describe en L</Modificadores del conjunto de caracteres>.

source: I<The LAYER parameter of the binmode() function is described as "DISCIPLINE" in "Programming Perl, 3rd Edition".
es_es: I<El parámetro CAPA de la función binmode() se describe como "DISCIPLINA" en "Programming Perl, 3rd Edition".

source: =head2 Backwards compatibility
es_es: =head2 Compatibilidad con versiones anteriores

source: This document varies from difficult to understand to completely and utterly opaque.
es_es: Este documento varía de "difícil de entender" a "completa y totalmente opaco".

source: C<File::Path> upgraded to version 1.08
es_es: C<File::Path> actualizado a la versión 1.08

source: sub logger {
es_es: sub registrador {

source: It can be used after running C<make install> (or your platform's equivalent procedure) to verify that perl and its libraries have been installed correctly.
es_es: Se puede usar después de ejecutar C<make install> (o el procedimiento equivalente para su plataforma) para comprobar que perl y sus bibliotecas se han instalado correctamente.
